{
    "day1": {
        "todayTasks": [
            "Birkaç adım geriye dönmek zorunda kaldım, geri dönüp tekrar başlayacağım",
            "OCR kısmında kartı gördüğünde arka arkaya 3 çekim yapacak şekilde optimize etmeye çalışacağım",
            "NFC kısmında okuma işleminde bir problem oluştu. Asenkronluk ile alakalı bir problem var OCR -> NFC geçişinde. Bunu düzeltmeliyim"
        ],
        "potentialProblems": [
            "OCR kısmında kartı görme konusunda ve kartı ayırt edebilme konusunda configrasyon sorunları çekebilirim",
            "Sanırım ekstra bir paket veya C++ kısmında geliştirme gerekebilir ve Java bilgisi ile C++ yazarken zorlanıyorum"
        ],
        "completedToday": [
            "OCR kısmında 3 fotoğraf çekme optimizasyonu yaptım",
            "NFC kısmından bilgileri düzgün okumaya başladı"
        ],
        "issuesEncountered": [
            "OCR hala kart tanıma konusunda sorunlar çekiyor. Kartı algılamak için birkaç fotoğraf çekiyor ve bu cache'i dolduruyor",
            "NFC kısmında okuma işleminde bir problem oluştu. Asenkronluk ile alakalı bir problem var OCR -> NFC geçişinde",
            "NFC okuma işleminde okumak için gelmesini beklemediği bilgiler gelmeden okumaya çalıştığı için okuyamıyor ve  telefonda txt dosyasına kaydediyor",
            "Kullandığım image-crop-picker paketi sorun çıkardı",
            "Eski dosyama döndüğümde config dosyaları çok büyük problemler çıkardı"
        ]
    },
    "day2": {
        "todayTasks": [
            "OCR kısmında thread ve cache yönetimini düzeltmeliyim",
            "NFC tarafındaki asenkronluk sorununu düzeltmeliyim"
        ],
        "potentialProblems": [
            "Temiz bir kafa ile dikkatimi tam vermezsem işler çok zor olur benim için"
        ],
        "completedToday": [
            "OCR kısmında thread ve cache yönetimini yaptım ve okuma işlemi oluyor",
            "NFC için protocol ve crypto işlemlerini yaptım",
            "NFC protokollerinde EF.CardAccess dosyası bulunursa → PACE kullanılıyor, Bulunamazsa → BAC (legacy) kullanılıyor"
        ],
        "issuesEncountered": [
            "OCR kısmında 3 fotoğrafı çekip optimize etmek yerine fotoğraf çekip okuma yapıyor ve bunu 3 kere arka arkaya yapıyor",
            "NFC kısmında protocoller ve cryptolar doğru şekilde entegre çalışmıyor"
        ]
    },
    "day3": {
        "todayTasks": [
            "NFC tarafındaki protocoller ve crypto sorunlarını çözmeliyim",
            "OCR kısmındaki fotoğraf olayını optimize etmeliyim"
        ],
        "potentialProblems": [
            "Protocoller bana biraz sorun yaşatabilir"
        ],
        "completedToday": [
            "NFC protokolleri hakkında bir çok şey öğrendim"
        ],
        "issuesEncountered": [
            "NFC çözümlemesi için 55 farklı yöntem denedim ama hiçbiri olmadı",
            "Tersine mühendislik ile E-Devlet'in NFC okumasına bakmaya çalıştım ama tam yapamadım. Gece boyu buna uğraşacağım"
        ]
    },
    "day4": {
        "todayTasks": [
            "NFC protokolleri için tersine mühendislik işlemine devam edeceğim",
            "Eğer NFC kısmı biterse OCR kısmını optimize edeceğim"
        ],
        "potentialProblems": [
            "Bu sorunu çözmek tüm günümü alacak gibi görünüyor ama ondan sonra hiçbir işim kalmıyor neredeyse"
        ],
        "completedToday": [
            "OCR kısmında ufak optimizasyonlar yaptım",
            "NFC protokolleri hakkında bir çok şey öğrendim"
        ],
        "issuesEncountered": [
            "NFC'de CAN numarasına ulaşamadığım için hiçbir şey yapamadım"
        ]
    },
    "day5": {
        "todayTasks": [
            "OCR kısmını optimize etmek ile uğraşacağım. Daha nasıl hızlandırabilirim ve kaliteli hale getirebilirim diye",
            "Liveness modülünü bitireceğim"
        ],
        "potentialProblems": [
            "Liveness kısmında yüz tanıma doğruluğu konusunda bazı zorluklar yaşayabilirim"
        ],
        "completedToday": [
            "Birkaç kod incelemesi yaptım"
        ],
        "issuesEncountered": [
            "NFC kısmındaki sorunlar devam ediyor",
            "Yarın saat 09.00'a kadar aralıksız bu sorunu çözmeye çalışacağım eğer olmazsa sanırım oturup ağlayacağım"
        ]
    },
    "day6": {
        "todayTasks": [
            "Bugün Liveness kısmını bitireceğim",
            "NFC sorununu hala çözemedim"
        ],
        "potentialProblems": [
            "Liveness kısmında yüz karşılaştırma doğruluğu konusunda sorunlar yaşayabilirim"
        ],
        "completedToday": [
            ""
        ],
        "issuesEncountered": [
            ""
        ]
    },
    "day7": {
        "todayTasks": [
            "NFC SORUNU SONUNDA TAMAMEN ÇÖZÜLDÜ",
            "OCR'ı azıcık optimize edip paketleyeğim"
        ],
        "potentialProblems": [
            "O kadar mutluyum ki düşünemiyorum"
        ],
        "completedToday": [
            "Liveness kodlarını gözden geçirdim",
            "OCR için workflow çıkardım"
        ],
        "issuesEncountered": [
            "Enerjim bitti, yarın kendime izin vereceğim"
        ]
    },
     "day8": {
        "todayTasks": [
            "Ağır iş yapmamak için Liveness için workflow oluşturacağım",
            "Canlı karşılaştırma için araştırma yapacağım"
        ],
        "potentialProblems": [
            "Bugün kendi bilgisayarım yanımda değil o yüzden teorik kısımları halledeceğim",
            "Çalışmazsam suçlu gibi hissediyorum"
        ],
        "completedToday": [
            ""
        ],
        "issuesEncountered": [
            ""
        ]
    }
}